export const searchIndex = [
  {
    "title": "",
    "headers": [],
    "path": "/",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "介绍页",
    "headers": [
      {
        "level": 2,
        "title": "标题2",
        "slug": "标题2",
        "link": "#标题2",
        "children": []
      }
    ],
    "path": "/basic/the-test.html",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "寻找李宗盛-既然青春留不住",
    "headers": [
      {
        "level": 2,
        "title": "🔷 《鬼迷心窍》",
        "slug": "🔷-《鬼迷心窍》",
        "link": "#🔷-《鬼迷心窍》",
        "children": []
      },
      {
        "level": 2,
        "title": "🔷 《我是真的爱你》",
        "slug": "🔷-《我是真的爱你》",
        "link": "#🔷-《我是真的爱你》",
        "children": []
      },
      {
        "level": 2,
        "title": "🔷 《爱的代价》",
        "slug": "🔷-《爱的代价》",
        "link": "#🔷-《爱的代价》",
        "children": []
      },
      {
        "level": 2,
        "title": "🔷 《不必在乎我是谁》",
        "slug": "🔷-《不必在乎我是谁》",
        "link": "#🔷-《不必在乎我是谁》",
        "children": []
      },
      {
        "level": 2,
        "title": "🔷 《领悟》",
        "slug": "🔷-《领悟》",
        "link": "#🔷-《领悟》",
        "children": []
      }
    ],
    "path": "/find/find-Li-Zongsheng.html",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "寻找童锦程-把爱留在798",
    "headers": [],
    "path": "/find/find-Tong-Jincheng.html",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "什么是编程语言",
    "headers": [],
    "path": "/basic/beginner-guide-2022/1-what-is-program-language.html",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "什么是C语言与我的强烈建议 - 先学C,而不是c++,java等",
    "headers": [],
    "path": "/basic/beginner-guide-2022/2-What-is-C-and-my-suggestions.html",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "C语言的发展史",
    "headers": [],
    "path": "/basic/beginner-guide-2022/3-C-development-history.html",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "学习编程和C语言难吗",
    "headers": [],
    "path": "/basic/beginner-guide-2022/4-is-programming-and-C-difficult.html",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "英语和数学不好可以学编程吗",
    "headers": [
      {
        "level": 2,
        "title": "1.英语不好可以学编程吗",
        "slug": "_1-英语不好可以学编程吗",
        "link": "#_1-英语不好可以学编程吗",
        "children": []
      },
      {
        "level": 2,
        "title": "2.数学不好可以学编程吗",
        "slug": "_2-数学不好可以学编程吗",
        "link": "#_2-数学不好可以学编程吗",
        "children": []
      }
    ],
    "path": "/basic/beginner-guide-2022/5-not-good-at-english-and-math-can-program.html",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "各种编程语言间的鄙视链",
    "headers": [],
    "path": "/basic/beginner-guide-2022/6-contempt-chain-between-languages.html",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "7.编程学习的心得分享（仅个人心得，仅供参照或选择忽略，勿喷）",
    "headers": [
      {
        "level": 2,
        "title": "1.学会做笔记，有自己的笔记库",
        "slug": "_1-学会做笔记-有自己的笔记库",
        "link": "#_1-学会做笔记-有自己的笔记库",
        "children": []
      },
      {
        "level": 2,
        "title": "2.代码不要死记硬背，关键在于理解是干嘛的",
        "slug": "_2-代码不要死记硬背-关键在于理解是干嘛的",
        "link": "#_2-代码不要死记硬背-关键在于理解是干嘛的",
        "children": []
      },
      {
        "level": 2,
        "title": "3.养成良好的编程习惯",
        "slug": "_3-养成良好的编程习惯",
        "link": "#_3-养成良好的编程习惯",
        "children": [
          {
            "level": 3,
            "title": "🍀 一定要格式化代码",
            "slug": "🍀-一定要格式化代码",
            "link": "#🍀-一定要格式化代码",
            "children": []
          },
          {
            "level": 3,
            "title": "🍀 标识符规范命名",
            "slug": "🍀-标识符规范命名",
            "link": "#🍀-标识符规范命名",
            "children": []
          },
          {
            "level": 3,
            "title": "🍀 学会写注释",
            "slug": "🍀-学会写注释",
            "link": "#🍀-学会写注释",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "4.程序是用大脑写的，而不是用手写。",
        "slug": "_4-程序是用大脑写的-而不是用手写。",
        "link": "#_4-程序是用大脑写的-而不是用手写。",
        "children": []
      },
      {
        "level": 2,
        "title": "5.一定要亲自写代码，能听懂与会使用是两码事",
        "slug": "_5-一定要亲自写代码-能听懂与会使用是两码事",
        "link": "#_5-一定要亲自写代码-能听懂与会使用是两码事",
        "children": []
      }
    ],
    "path": "/basic/beginner-guide-2022/7-sharing-of-experience-in-programming-learning.html",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "回答初学者的其它一些疑惑与理解误区（仅个人观点，如意见不同可忽略，勿喷）",
    "headers": [
      {
        "level": 2,
        "title": "1.学习C语言我应该用什么编程工具比较好",
        "slug": "_1-学习c语言我应该用什么编程工具比较好",
        "link": "#_1-学习c语言我应该用什么编程工具比较好",
        "children": []
      },
      {
        "level": 2,
        "title": "2.认真上好学校的课程就够了吗",
        "slug": "_2-认真上好学校的课程就够了吗",
        "link": "#_2-认真上好学校的课程就够了吗",
        "children": []
      },
      {
        "level": 2,
        "title": "3.有哪些好的编程学习视频，该如何选择",
        "slug": "_3-有哪些好的编程学习视频-该如何选择",
        "link": "#_3-有哪些好的编程学习视频-该如何选择",
        "children": []
      },
      {
        "level": 2,
        "title": "4.我是应该先读书还是先看学习视频呢",
        "slug": "_4-我是应该先读书还是先看学习视频呢",
        "link": "#_4-我是应该先读书还是先看学习视频呢",
        "children": []
      },
      {
        "level": 2,
        "title": "5.C语言学到哪个程度可以开始自己写代码",
        "slug": "_5-c语言学到哪个程度可以开始自己写代码",
        "link": "#_5-c语言学到哪个程度可以开始自己写代码",
        "children": []
      },
      {
        "level": 2,
        "title": "6.我应该要学习很多编程语言吗",
        "slug": "_6-我应该要学习很多编程语言吗",
        "link": "#_6-我应该要学习很多编程语言吗",
        "children": []
      },
      {
        "level": 2,
        "title": "7.哪种编程语言更好，误区：我就想学最好的编程语言",
        "slug": "_7-哪种编程语言更好-误区-我就想学最好的编程语言",
        "link": "#_7-哪种编程语言更好-误区-我就想学最好的编程语言",
        "children": []
      },
      {
        "level": 2,
        "title": "8.大一上的我需要去纠结走哪个方向吗",
        "slug": "_8-大一上的我需要去纠结走哪个方向吗",
        "link": "#_8-大一上的我需要去纠结走哪个方向吗",
        "children": []
      },
      {
        "level": 2,
        "title": "9.感觉自己初次刷题没思路没感觉怎么办",
        "slug": "_9-感觉自己初次刷题没思路没感觉怎么办",
        "link": "#_9-感觉自己初次刷题没思路没感觉怎么办",
        "children": []
      },
      {
        "level": 2,
        "title": "10.如果我在写代码中遇到问题怎么办",
        "slug": "_10-如果我在写代码中遇到问题怎么办",
        "link": "#_10-如果我在写代码中遇到问题怎么办",
        "children": []
      },
      {
        "level": 2,
        "title": "11.非计算机专业可以学编程吗",
        "slug": "_11-非计算机专业可以学编程吗",
        "link": "#_11-非计算机专业可以学编程吗",
        "children": []
      }
    ],
    "path": "/basic/beginner-guide-2022/8-answer-some-other-questions.html",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "⭐ 初学者值得一看：什么是C语言，学习建议，解疑与误区",
    "headers": [],
    "path": "/basic/beginner-guide-2022/",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "编程的几个基本概念",
    "headers": [],
    "path": "/basic/beginner-guide-2023/1-program-basic-concepts.html",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "我是非计算机专业可以学好编程吗",
    "headers": [],
    "path": "/basic/beginner-guide-2023/10-can-I-learn-programming-well-if-I-am-not-a-computer-major.html",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "我认认真真上好学校的课程就够了吗",
    "headers": [],
    "path": "/basic/beginner-guide-2023/11-am-I-serious-enough-to-attend-good-school-courses.html",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "关于 C 语言",
    "headers": [
      {
        "level": 2,
        "title": "1.C 语言的发展史",
        "slug": "_1-c-语言的发展史",
        "link": "#_1-c-语言的发展史",
        "children": []
      },
      {
        "level": 2,
        "title": "2.为什么我推荐先学习 C 学习",
        "slug": "_2-为什么我推荐先学习-c-学习",
        "link": "#_2-为什么我推荐先学习-c-学习",
        "children": [
          {
            "level": 3,
            "title": "🍀 适合初学者入门",
            "slug": "🍀-适合初学者入门",
            "link": "#🍀-适合初学者入门",
            "children": []
          },
          {
            "level": 3,
            "title": "🍀 影响深远",
            "slug": "🍀-影响深远",
            "link": "#🍀-影响深远",
            "children": []
          },
          {
            "level": 3,
            "title": "🍀 C 生万物",
            "slug": "🍀-c-生万物",
            "link": "#🍀-c-生万物",
            "children": []
          },
          {
            "level": 3,
            "title": "🍀 更实际的",
            "slug": "🍀-更实际的",
            "link": "#🍀-更实际的",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "3.学习 C 语言用什么编程工具比较好",
        "slug": "_3-学习-c-语言用什么编程工具比较好",
        "link": "#_3-学习-c-语言用什么编程工具比较好",
        "children": []
      },
      {
        "level": 2,
        "title": "4.推荐的 C 语言学习视频",
        "slug": "_4-推荐的-c-语言学习视频",
        "link": "#_4-推荐的-c-语言学习视频",
        "children": []
      },
      {
        "level": 2,
        "title": "5.C 语言学到哪个程度可以开始自己写代码",
        "slug": "_5-c-语言学到哪个程度可以开始自己写代码",
        "link": "#_5-c-语言学到哪个程度可以开始自己写代码",
        "children": []
      }
    ],
    "path": "/basic/beginner-guide-2023/12-about-c-language.html",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "编程学习的心得分享",
    "headers": [
      {
        "level": 2,
        "title": "1.学会做笔记，有自己的笔记库",
        "slug": "_1-学会做笔记-有自己的笔记库",
        "link": "#_1-学会做笔记-有自己的笔记库",
        "children": []
      },
      {
        "level": 2,
        "title": "2.代码不要死记硬背，关键在于理解是干嘛的",
        "slug": "_2-代码不要死记硬背-关键在于理解是干嘛的",
        "link": "#_2-代码不要死记硬背-关键在于理解是干嘛的",
        "children": []
      },
      {
        "level": 2,
        "title": "3.养成良好的编程习惯",
        "slug": "_3-养成良好的编程习惯",
        "link": "#_3-养成良好的编程习惯",
        "children": [
          {
            "level": 3,
            "title": "🍀 一定要格式化代码",
            "slug": "🍀-一定要格式化代码",
            "link": "#🍀-一定要格式化代码",
            "children": []
          },
          {
            "level": 3,
            "title": "🍀 标识符规范命名",
            "slug": "🍀-标识符规范命名",
            "link": "#🍀-标识符规范命名",
            "children": []
          },
          {
            "level": 3,
            "title": "🍀 学会写注释",
            "slug": "🍀-学会写注释",
            "link": "#🍀-学会写注释",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "4.程序是用大脑写的，而不是用手写。",
        "slug": "_4-程序是用大脑写的-而不是用手写。",
        "link": "#_4-程序是用大脑写的-而不是用手写。",
        "children": []
      },
      {
        "level": 2,
        "title": "5.一定要亲自写代码，能听懂与会使用是两码事",
        "slug": "_5-一定要亲自写代码-能听懂与会使用是两码事",
        "link": "#_5-一定要亲自写代码-能听懂与会使用是两码事",
        "children": []
      },
      {
        "level": 2,
        "title": "6.有目的地去学习",
        "slug": "_6-有目的地去学习",
        "link": "#_6-有目的地去学习",
        "children": []
      }
    ],
    "path": "/basic/beginner-guide-2023/13-sharing-of-experience-in-programming-learning.html",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "程序员成长的三阶段",
    "headers": [
      {
        "level": 2,
        "title": "1.第一阶段",
        "slug": "_1-第一阶段",
        "link": "#_1-第一阶段",
        "children": []
      },
      {
        "level": 2,
        "title": "2.第二阶段",
        "slug": "_2-第二阶段",
        "link": "#_2-第二阶段",
        "children": []
      },
      {
        "level": 2,
        "title": "3.第三阶段",
        "slug": "_3-第三阶段",
        "link": "#_3-第三阶段",
        "children": []
      },
      {
        "level": 2,
        "title": "4.程序员出身的大佬",
        "slug": "_4-程序员出身的大佬",
        "link": "#_4-程序员出身的大佬",
        "children": []
      }
    ],
    "path": "/basic/beginner-guide-2023/14-the-three-stages-of-programmer-growth.html",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "计算机基础知识",
    "headers": [],
    "path": "/basic/beginner-guide-2023/15-computer-basics.html",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "在大学",
    "headers": [
      {
        "level": 2,
        "title": "1.社团&学生会&团委会",
        "slug": "_1-社团-学生会-团委会",
        "link": "#_1-社团-学生会-团委会",
        "children": []
      },
      {
        "level": 2,
        "title": "2.编程类比赛",
        "slug": "_2-编程类比赛",
        "link": "#_2-编程类比赛",
        "children": []
      },
      {
        "level": 2,
        "title": "3.大学的专业课程",
        "slug": "_3-大学的专业课程",
        "link": "#_3-大学的专业课程",
        "children": []
      },
      {
        "level": 2,
        "title": "4.考证",
        "slug": "_4-考证",
        "link": "#_4-考证",
        "children": []
      },
      {
        "level": 2,
        "title": "5.考研与就业",
        "slug": "_5-考研与就业",
        "link": "#_5-考研与就业",
        "children": []
      }
    ],
    "path": "/basic/beginner-guide-2023/16-at-university.html",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "编程世界的职业道路",
    "headers": [
      {
        "level": 2,
        "title": "1.常用编程语言与发展方向",
        "slug": "_1-常用编程语言与发展方向",
        "link": "#_1-常用编程语言与发展方向",
        "children": []
      },
      {
        "level": 2,
        "title": "2.编程相关的常见工作岗位",
        "slug": "_2-编程相关的常见工作岗位",
        "link": "#_2-编程相关的常见工作岗位",
        "children": [
          {
            "level": 3,
            "title": "🍀 开发类",
            "slug": "🍀-开发类",
            "link": "#🍀-开发类",
            "children": []
          },
          {
            "level": 3,
            "title": "🍀 测试类",
            "slug": "🍀-测试类",
            "link": "#🍀-测试类",
            "children": []
          },
          {
            "level": 3,
            "title": "🍀 非技术类",
            "slug": "🍀-非技术类",
            "link": "#🍀-非技术类",
            "children": []
          }
        ]
      }
    ],
    "path": "/basic/beginner-guide-2023/17-career-paths-in-the-programming-world.html",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "值得一读",
    "headers": [
      {
        "level": 2,
        "title": "1.一些计算机科技行业读物",
        "slug": "_1-一些计算机科技行业读物",
        "link": "#_1-一些计算机科技行业读物",
        "children": []
      }
    ],
    "path": "/basic/beginner-guide-2023/18-books.html",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "学习编程难吗",
    "headers": [],
    "path": "/basic/beginner-guide-2023/2-is-it-difficulty-to-learn-program.html",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "英语和数学不好可以学编程吗",
    "headers": [
      {
        "level": 2,
        "title": "1.英语不好可以学编程吗",
        "slug": "_1-英语不好可以学编程吗",
        "link": "#_1-英语不好可以学编程吗",
        "children": []
      },
      {
        "level": 2,
        "title": "2.数学不好可以学编程吗",
        "slug": "_2-数学不好可以学编程吗",
        "link": "#_2-数学不好可以学编程吗",
        "children": []
      }
    ],
    "path": "/basic/beginner-guide-2023/3-math-and-english-to-program.html",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "我应该要学习很多编程语言吗",
    "headers": [],
    "path": "/basic/beginner-guide-2023/4-should-I-learn-many-programming-language.html",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "世界上最好的编程语言是什么",
    "headers": [],
    "path": "/basic/beginner-guide-2023/5-what-is-the-best-programming-language.html",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "大一上需要去纠结走哪个方向吗",
    "headers": [],
    "path": "/basic/beginner-guide-2023/6-do-I-need-to-struggle-in-which-direction-to-take-in-my-freshman-year.html",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "初次刷题没思路没感觉正常吗",
    "headers": [],
    "path": "/basic/beginner-guide-2023/7-no-ideas-to-questions.html",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "如果我在写代码时遇到问题怎么办",
    "headers": [],
    "path": "/basic/beginner-guide-2023/8-what-if-I-encounter-problems-while-writing-code.html",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "学习编程是应该先看书还是先看视频呢",
    "headers": [],
    "path": "/basic/beginner-guide-2023/9-book-or-video-about-learning-program.html",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "写在前面",
    "headers": [
      {
        "level": 2,
        "title": "1.为什么有这份指南",
        "slug": "_1-为什么有这份指南",
        "link": "#_1-为什么有这份指南",
        "children": []
      },
      {
        "level": 2,
        "title": "2.指南里有什么",
        "slug": "_2-指南里有什么",
        "link": "#_2-指南里有什么",
        "children": []
      },
      {
        "level": 2,
        "title": "3.关于软件协会",
        "slug": "_3-关于软件协会",
        "link": "#_3-关于软件协会",
        "children": []
      },
      {
        "level": 2,
        "title": "4.一些思考",
        "slug": "_4-一些思考",
        "link": "#_4-一些思考",
        "children": [
          {
            "level": 3,
            "title": "🍀 对工作：越努力越幸运",
            "slug": "🍀-对工作-越努力越幸运",
            "link": "#🍀-对工作-越努力越幸运",
            "children": []
          },
          {
            "level": 3,
            "title": "🍀 对感情：爱得厚重开阔",
            "slug": "🍀-对感情-爱得厚重开阔",
            "link": "#🍀-对感情-爱得厚重开阔",
            "children": []
          },
          {
            "level": 3,
            "title": "🍀 对他人：保持尊重、友好、真诚和谦逊",
            "slug": "🍀-对他人-保持尊重、友好、真诚和谦逊",
            "link": "#🍀-对他人-保持尊重、友好、真诚和谦逊",
            "children": []
          },
          {
            "level": 3,
            "title": "🍀 对生活：骄傲柔软地活着",
            "slug": "🍀-对生活-骄傲柔软地活着",
            "link": "#🍀-对生活-骄傲柔软地活着",
            "children": []
          }
        ]
      }
    ],
    "path": "/basic/beginner-guide-2023/",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "",
    "headers": [],
    "path": "/404.html",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "Basic",
    "headers": [],
    "path": "/basic/",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "Find",
    "headers": [],
    "path": "/find/",
    "pathLocale": "/",
    "extraFields": []
  }
]
