export const searchIndex = [
  {
    "title": "",
    "headers": [],
    "path": "/",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "介绍页",
    "headers": [
      {
        "level": 2,
        "title": "标题1",
        "slug": "标题1",
        "link": "#标题1",
        "children": [
          {
            "level": 3,
            "title": "1.1",
            "slug": "_1-1",
            "link": "#_1-1",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "标题2",
        "slug": "标题2",
        "link": "#标题2",
        "children": []
      }
    ],
    "path": "/basic/the-test.html",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "什么是编程语言",
    "headers": [],
    "path": "/basic/beginner-guide-2022/1-what-is-program-language.html",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "什么是C语言与我的强烈建议 - 先学C,而不是c++,java等",
    "headers": [],
    "path": "/basic/beginner-guide-2022/2-What-is-C-and-my-suggestions.html",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "C语言的发展史",
    "headers": [],
    "path": "/basic/beginner-guide-2022/3-C-development-history.html",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "学习编程和C语言难吗",
    "headers": [],
    "path": "/basic/beginner-guide-2022/4-is-programming-and-C-difficult.html",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "英语和数学不好可以学编程吗",
    "headers": [
      {
        "level": 2,
        "title": "1.英语不好可以学编程吗",
        "slug": "_1-英语不好可以学编程吗",
        "link": "#_1-英语不好可以学编程吗",
        "children": []
      },
      {
        "level": 2,
        "title": "2.数学不好可以学编程吗",
        "slug": "_2-数学不好可以学编程吗",
        "link": "#_2-数学不好可以学编程吗",
        "children": []
      }
    ],
    "path": "/basic/beginner-guide-2022/5-not-good-at-english-and-math-can-program.html",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "各种编程语言间的鄙视链",
    "headers": [],
    "path": "/basic/beginner-guide-2022/6-contempt-chain-between-languages.html",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "7.编程学习的心得分享（仅个人心得，仅供参照或选择忽略，勿喷）",
    "headers": [
      {
        "level": 2,
        "title": "1.学会做笔记，有自己的笔记库",
        "slug": "_1-学会做笔记-有自己的笔记库",
        "link": "#_1-学会做笔记-有自己的笔记库",
        "children": []
      },
      {
        "level": 2,
        "title": "2.代码不要死记硬背，关键在于理解是干嘛的",
        "slug": "_2-代码不要死记硬背-关键在于理解是干嘛的",
        "link": "#_2-代码不要死记硬背-关键在于理解是干嘛的",
        "children": []
      },
      {
        "level": 2,
        "title": "3.养成良好的编程习惯",
        "slug": "_3-养成良好的编程习惯",
        "link": "#_3-养成良好的编程习惯",
        "children": [
          {
            "level": 3,
            "title": "🍀 一定要格式化代码",
            "slug": "🍀-一定要格式化代码",
            "link": "#🍀-一定要格式化代码",
            "children": []
          },
          {
            "level": 3,
            "title": "🍀 标识符规范命名",
            "slug": "🍀-标识符规范命名",
            "link": "#🍀-标识符规范命名",
            "children": []
          },
          {
            "level": 3,
            "title": "🍀 学会写注释",
            "slug": "🍀-学会写注释",
            "link": "#🍀-学会写注释",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "4.程序是用大脑写的，而不是用手写。",
        "slug": "_4-程序是用大脑写的-而不是用手写。",
        "link": "#_4-程序是用大脑写的-而不是用手写。",
        "children": []
      },
      {
        "level": 2,
        "title": "5.一定要亲自写代码，能听懂与会使用是两码事",
        "slug": "_5-一定要亲自写代码-能听懂与会使用是两码事",
        "link": "#_5-一定要亲自写代码-能听懂与会使用是两码事",
        "children": []
      }
    ],
    "path": "/basic/beginner-guide-2022/7-sharing-of-experience-in-programming-learning.html",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "回答初学者的其它一些疑惑与理解误区（仅个人观点，如意见不同可忽略，勿喷）",
    "headers": [
      {
        "level": 2,
        "title": "1.学习C语言我应该用什么编程工具比较好",
        "slug": "_1-学习c语言我应该用什么编程工具比较好",
        "link": "#_1-学习c语言我应该用什么编程工具比较好",
        "children": []
      },
      {
        "level": 2,
        "title": "2.认真上好学校的课程就够了吗",
        "slug": "_2-认真上好学校的课程就够了吗",
        "link": "#_2-认真上好学校的课程就够了吗",
        "children": []
      },
      {
        "level": 2,
        "title": "3.有哪些好的编程学习视频，该如何选择",
        "slug": "_3-有哪些好的编程学习视频-该如何选择",
        "link": "#_3-有哪些好的编程学习视频-该如何选择",
        "children": []
      },
      {
        "level": 2,
        "title": "4.我是应该先读书还是先看学习视频呢",
        "slug": "_4-我是应该先读书还是先看学习视频呢",
        "link": "#_4-我是应该先读书还是先看学习视频呢",
        "children": []
      },
      {
        "level": 2,
        "title": "5.C语言学到哪个程度可以开始自己写代码",
        "slug": "_5-c语言学到哪个程度可以开始自己写代码",
        "link": "#_5-c语言学到哪个程度可以开始自己写代码",
        "children": []
      },
      {
        "level": 2,
        "title": "6.我应该要学习很多编程语言吗",
        "slug": "_6-我应该要学习很多编程语言吗",
        "link": "#_6-我应该要学习很多编程语言吗",
        "children": []
      },
      {
        "level": 2,
        "title": "7.哪种编程语言更好，误区：我就想学最好的编程语言",
        "slug": "_7-哪种编程语言更好-误区-我就想学最好的编程语言",
        "link": "#_7-哪种编程语言更好-误区-我就想学最好的编程语言",
        "children": []
      },
      {
        "level": 2,
        "title": "8.大一上的我需要去纠结走哪个方向吗",
        "slug": "_8-大一上的我需要去纠结走哪个方向吗",
        "link": "#_8-大一上的我需要去纠结走哪个方向吗",
        "children": []
      },
      {
        "level": 2,
        "title": "9.感觉自己初次刷题没思路没感觉怎么办",
        "slug": "_9-感觉自己初次刷题没思路没感觉怎么办",
        "link": "#_9-感觉自己初次刷题没思路没感觉怎么办",
        "children": []
      },
      {
        "level": 2,
        "title": "10.如果我在写代码中遇到问题怎么办",
        "slug": "_10-如果我在写代码中遇到问题怎么办",
        "link": "#_10-如果我在写代码中遇到问题怎么办",
        "children": []
      },
      {
        "level": 2,
        "title": "11.非计算机专业可以学编程吗",
        "slug": "_11-非计算机专业可以学编程吗",
        "link": "#_11-非计算机专业可以学编程吗",
        "children": []
      }
    ],
    "path": "/basic/beginner-guide-2022/8-answer-some-other-questions.html",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "⭐ 初学者值得一看：什么是C语言，学习建议，解疑与误区",
    "headers": [],
    "path": "/basic/beginner-guide-2022/",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "编程的几个基本概念",
    "headers": [],
    "path": "/basic/beginner-guide-2023/1-program-basic-concepts.html",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "",
    "headers": [],
    "path": "/basic/beginner-guide-2023/",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "",
    "headers": [],
    "path": "/404.html",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "Basic",
    "headers": [],
    "path": "/basic/",
    "pathLocale": "/",
    "extraFields": []
  }
]

if (import.meta.webpackHot) {
  import.meta.webpackHot.accept()
  if (__VUE_HMR_RUNTIME__.updateSearchIndex) {
    __VUE_HMR_RUNTIME__.updateSearchIndex(searchIndex)
  }
}

if (import.meta.hot) {
  import.meta.hot.accept(({ searchIndex }) => {
    __VUE_HMR_RUNTIME__.updateSearchIndex(searchIndex)
  })
}
