export const searchIndex = [
  {
    "title": "",
    "headers": [],
    "path": "/",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "⭐ 初学者值得一看：什么是C语言，学习建议，解疑与误区",
    "headers": [
      {
        "level": 2,
        "title": "6.1 英语不好可以学编程吗",
        "slug": "_6-1-英语不好可以学编程吗",
        "link": "#_6-1-英语不好可以学编程吗",
        "children": []
      },
      {
        "level": 2,
        "title": "6.2 数学不好可以学编程吗",
        "slug": "_6-2-数学不好可以学编程吗",
        "link": "#_6-2-数学不好可以学编程吗",
        "children": []
      },
      {
        "level": 2,
        "title": "7.1 学会做笔记，有自己的笔记库",
        "slug": "_7-1-学会做笔记-有自己的笔记库",
        "link": "#_7-1-学会做笔记-有自己的笔记库",
        "children": []
      },
      {
        "level": 2,
        "title": "7.2 🚩 代码不要死记硬背，关键在于理解是干嘛的",
        "slug": "_7-2-代码不要死记硬背-关键在于理解是干嘛的",
        "link": "#_7-2-代码不要死记硬背-关键在于理解是干嘛的",
        "children": []
      },
      {
        "level": 2,
        "title": "7.3 养成良好的编程习惯",
        "slug": "_7-3-养成良好的编程习惯",
        "link": "#_7-3-养成良好的编程习惯",
        "children": [
          {
            "level": 3,
            "title": "7.3.1 一定要格式化代码",
            "slug": "_7-3-1-一定要格式化代码",
            "link": "#_7-3-1-一定要格式化代码",
            "children": []
          },
          {
            "level": 3,
            "title": "7.3.2 标识符规范命名",
            "slug": "_7-3-2-标识符规范命名",
            "link": "#_7-3-2-标识符规范命名",
            "children": []
          },
          {
            "level": 3,
            "title": "7.3.3 学会写注释",
            "slug": "_7-3-3-学会写注释",
            "link": "#_7-3-3-学会写注释",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "7.4 程序是用大脑写的，而不是用手写。",
        "slug": "_7-4-程序是用大脑写的-而不是用手写。",
        "link": "#_7-4-程序是用大脑写的-而不是用手写。",
        "children": []
      },
      {
        "level": 2,
        "title": "7.5 一定要亲自写代码，能听懂与会使用是两码事",
        "slug": "_7-5-一定要亲自写代码-能听懂与会使用是两码事",
        "link": "#_7-5-一定要亲自写代码-能听懂与会使用是两码事",
        "children": []
      },
      {
        "level": 2,
        "title": "8.1 学习C语言我应该用什么编程工具比较好",
        "slug": "_8-1-学习c语言我应该用什么编程工具比较好",
        "link": "#_8-1-学习c语言我应该用什么编程工具比较好",
        "children": []
      },
      {
        "level": 2,
        "title": "8.2 认真上好学校的课程就够了吗",
        "slug": "_8-2-认真上好学校的课程就够了吗",
        "link": "#_8-2-认真上好学校的课程就够了吗",
        "children": []
      },
      {
        "level": 2,
        "title": "8.3 有哪些好的编程学习视频，该如何选择",
        "slug": "_8-3-有哪些好的编程学习视频-该如何选择",
        "link": "#_8-3-有哪些好的编程学习视频-该如何选择",
        "children": []
      },
      {
        "level": 2,
        "title": "8.4 我是应该先读书还是先看学习视频呢",
        "slug": "_8-4-我是应该先读书还是先看学习视频呢",
        "link": "#_8-4-我是应该先读书还是先看学习视频呢",
        "children": []
      },
      {
        "level": 2,
        "title": "8.5 C语言学到哪个程度可以开始自己写代码",
        "slug": "_8-5-c语言学到哪个程度可以开始自己写代码",
        "link": "#_8-5-c语言学到哪个程度可以开始自己写代码",
        "children": []
      },
      {
        "level": 2,
        "title": "8.6 我应该要学习很多编程语言吗",
        "slug": "_8-6-我应该要学习很多编程语言吗",
        "link": "#_8-6-我应该要学习很多编程语言吗",
        "children": []
      },
      {
        "level": 2,
        "title": "8.7 哪种编程语言更好，误区：我就想学最好的编程语言",
        "slug": "_8-7-哪种编程语言更好-误区-我就想学最好的编程语言",
        "link": "#_8-7-哪种编程语言更好-误区-我就想学最好的编程语言",
        "children": []
      },
      {
        "level": 2,
        "title": "8.8 大一上的我需要去纠结走哪个方向吗",
        "slug": "_8-8-大一上的我需要去纠结走哪个方向吗",
        "link": "#_8-8-大一上的我需要去纠结走哪个方向吗",
        "children": []
      },
      {
        "level": 2,
        "title": "8.9 感觉自己初次刷题没思路没感觉怎么办",
        "slug": "_8-9-感觉自己初次刷题没思路没感觉怎么办",
        "link": "#_8-9-感觉自己初次刷题没思路没感觉怎么办",
        "children": []
      },
      {
        "level": 2,
        "title": "8.10 如果我在写代码中遇到问题怎么办",
        "slug": "_8-10-如果我在写代码中遇到问题怎么办",
        "link": "#_8-10-如果我在写代码中遇到问题怎么办",
        "children": []
      },
      {
        "level": 2,
        "title": "8.11 非计算机专业可以学编程吗",
        "slug": "_8-11-非计算机专业可以学编程吗",
        "link": "#_8-11-非计算机专业可以学编程吗",
        "children": []
      }
    ],
    "path": "/basic/beginner-guide-2023.html",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "介绍页",
    "headers": [
      {
        "level": 2,
        "title": "标题1",
        "slug": "标题1",
        "link": "#标题1",
        "children": [
          {
            "level": 3,
            "title": "1.1",
            "slug": "_1-1",
            "link": "#_1-1",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "标题2",
        "slug": "标题2",
        "link": "#标题2",
        "children": []
      }
    ],
    "path": "/basic/the-test.html",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "什么是编程语言",
    "headers": [],
    "path": "/basic/beginner-guide-2022/1-what-is-program-language.html",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "⭐ 初学者值得一看：什么是C语言，学习建议，解疑与误区",
    "headers": [],
    "path": "/basic/beginner-guide-2022/",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "",
    "headers": [],
    "path": "/404.html",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "Basic",
    "headers": [],
    "path": "/basic/",
    "pathLocale": "/",
    "extraFields": []
  }
]

if (import.meta.webpackHot) {
  import.meta.webpackHot.accept()
  if (__VUE_HMR_RUNTIME__.updateSearchIndex) {
    __VUE_HMR_RUNTIME__.updateSearchIndex(searchIndex)
  }
}

if (import.meta.hot) {
  import.meta.hot.accept(({ searchIndex }) => {
    __VUE_HMR_RUNTIME__.updateSearchIndex(searchIndex)
  })
}
