<template><div><h1 id="大一上需要去纠结走哪个方向吗" tabindex="-1"><a class="header-anchor" href="#大一上需要去纠结走哪个方向吗" aria-hidden="true">#</a> 大一上需要去纠结走哪个方向吗</h1>
<p>完全不需要，就我个人的经历以为，大一上把 C 语言学好，把 <strong>编程思想</strong> 与 <strong>基础</strong> 打牢固是非常重要的。你在大一上学了 C，在以后你会发现在很多地方你都会见到 C 语言的影子。以及数据结构和算法的学习我们更推荐使用 C 语言来训练，因为 C 语言是最干净纯粹的通用经典计算机语言，可以极大帮助我们一拳一脚地养成规范的动作习惯。</p>
<p>和 Java、C++、Python、C#、JavaScript 等高级编程语言相比，<font color='red'>C 语言涉及到的编程概念少，词汇少，思想也简单。C 语言学习成本小附带的标准库小，所以整体比较简洁，容易学习，初学者能够在短时间内掌握编程技能，非常适合编程入门。</font></p>
</div></template>


